Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/problems_in_marriages_and_other_relationships/property_rights_and_the_breakdown_of_a_cohabiting_relationship.html.txt.tmx
Source language: en
Languages: ga

source: Property rights and the breakdown of a relationship
ga: Cearta maoine agus cliseadh ar chaidreamh

source: If a cohabiting couple splits up, the family home (and other family assets) will belong to the person who holds the legal title to the home/assets
ga: Má scarann lánúin chomhchónaithe, is leis an duine a bhfuil an teideal dlíthiúil aige/aici don teach/na sócmhainní a bheidh teach an teaghlaigh (agus sócmhainní eile an teaghlaigh)

source: This means that in the case of the family home, the person who originally bought the house and whose name is on the title deeds will usually own the house
ga: Ciallaíonn seo, i gcás theach an teaghlaigh, gur gnách gur leis an duine a cheannaigh an teach i dtosach báire agus a bhfuil a (h)ainm ar ghníomhais teidil an tí

source: This also applies to a married couple who split up
ga: Baineann seo le lánúin phósta, chomh maith, a scarann óna chéile

source: Marriage does not automatically give you ownership of your spouse’s assets
ga: Ní bhronnann pósadh úinéireacht ar shócmhainní do chéile ort go huathoibríoch

source: Where the family home was bought and registered in both spouses’ names, they are the joint owners
ga: Sa chás gur ceannaíodh teach an teaghlaigh agus go raibh sé cláraithe in ainmneacha na beirte lánúineacha, comhúinéirí atá iontu

source: However, where the house is registered in the name of one spouse only, it may be solely that spouse’s property
ga: Sa chás go bhfuil an teach cláraithe in ainm céile amháin, áfach, b’fhéidir go bhfuil an teach mar chuid de mhaoin an chéile sin amháin

source: You can read more about ownership in our documents on family homes and joint ownership of property
ga: Féadfaidh tú tuilleadh a léamh faoi úinéireacht inár gcáipéisí ar theach an teaghlaigh agus comhúinéireacht ar mhaoin

source: If your relationship breaks down and your name is not on the title deeds to the house, you may still be able to show that you have some ownership rights in relation to the house
ga: Má chliseann ar do chaidreamh áfach agus muna bhfuil do ainm ar ghníomhais teidil an tí, d'fhéadfadh sé go mbeadh tú fós in ann a thaispeáint go bhfuil roinnt cearta úinéireachta agat a bhaineann leis an teach

source: These rights are based on the fact that you made a contribution to the purchase price of the house with the intention of gaining a share in the ownership of the house
ga: Tá na cearta seo bunaithe ar an bhfíoras go ndéarna tú ranníocaíocht maidir le praghas ceannaithe an tigh agus é ar intinn agat scar den úinéireacht a bheith agat

source: Contributions to the purchase price of the house can be direct or indirect
ga: Is féidir le ranníocaíochtaí in aghaidh praghas ceannaithe an tigh a bheith díreach no indíreach

source: Direct contributions include contributions to the initial down payment for the house or contributions to the mortgage installments
ga: Áiríonn ranníocaíocht dhíreach ranníocaíocht ar an gcéad íocaíocht síos ar an teach nó ranníocaíochtaí in aghaidh na tráthchodanna morgáistí

source: Indirect contributions may include paying some of the other day-to-day household expenses or unpaid work in the legal owner of the house's business
ga: D'fhéadfadh ranníocaíocht indíreach áireamh a dhéanamh do íocaíochtaí i gcás roinnt de chostaisí laethúla eile teaghlaigh nó obair a rinneadh i ngnó an úinéara dlíthiúla agus nár íocadh

source: It has been held by the courts that working in the home looking after children and money spent or work done on home improvements are not contributions that give you any right of ownership in relation to the house
ga: Tá glactha leis ag an gcúirt nach dtugann ranníocaíochtaí cosúil le bheith ag obair ins an teach ag tabhairt aire do leanaí agus airgead a chaitheamh nó obair a rinneadh ar fheabhsúcháin tí aon chearta úinéireachta duit maidir leis an teach

source: Usually, where you can show that you have made a contribution to the purchase price of the house, you will be entitled to a share in the house in proportion to your contribution
ga: Go hiondúil má tá tú in ann a thaispeáint go ndéarna tú ranníocaíocht maidir le praghas ceannaithe an tí, beidh tú i dteideal scar den teach i gcomhréir le do ranníocaíocht

source: For example, if you have shown that you paid off half of a mortgage that represented 90% of the purchase price, you would be entitled to 45% of the ownership of the property
ga: Mar shampla, má thaispeáin tú gur íoc tú leath de mhorgáiste a bhí ionadaíoch ar 90% den phraghas ceannaithe, bheadh tú i dteideal 45% de úinéireacht na maoine

source: As well as showing that you made a financial contribution to the purchase price of the house, you must also show that your contribution was made with the intention of gaining a share in the ownership of the house and that you were not making a gift of the money to the legal owner of the house
ga: Chomh maith lena thaispeáint go ndearna tú ranníocaíocht airgeadais maidir le praghas ceannaithe an tí, caithfidh tú a thaispeáint freisin go ndearna tú an ranníocaíocht agus é ar intinn agat scar de úinéireacht an tí a bheith agat agus nach bronntanas a bhí san airgead do úinéir dlíthiúil an tí

source: Under the redress scheme for cohabiting couples a property adjustment order is one of the remedies available to the courts
ga: Faoin scéim sásaimh do lánúineacha comhchónaithe, tá ordú coigeartaithe maoine ar cheann de na réitigh a bhfuil fáil ag na cúirteanna orthu

source: A property adjustment order in relation to the family or shared home is usually applied for when applying for a decree of judicial separation, divorce or dissolution
ga: Is gnách go ndéantar iarratas ar ordú coigeartaithe maoine maidir leis an teaghlach nó le teach comhroinnte nuair a dhéantar iarratas ar fhoraithne idirscartha bhreithiúnaigh, cholscartha nó scaoilte

source: If you are in a situation where you are concerned about your rights following the breakdown of your cohabiting relationship, you should seek legal advice
ga: Má tá tú i gcás ina bhfuil tú buartha faoi do chuid cearta i ndiaidh gur theip ar do chaidreamh comhchónaithe, ba cheart duit comhairle dlí a lorg

source: Solicitors' fees are not fixed and can vary considerably
ga: Níl táillí aturnaetha seasta in Éirinn agus is féidir leo a bheith an-éagsúil óna chéile

source: Shop around and obtain some quotes before you decide on a particular legal firm
ga: Fiosraigh an scéal agus faigh roinnt meastachán sula ndéanann tú cinneadh faoi ghnólacht ar leith dlí

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar Fhaisnéis teagmhála le haghaidh gnólachtaí aturnaetha ar láithreán gréasáin Dhlí-Chumann na hÉireann

source: If you are eligible for legal aid and advice from the Legal Aid Board, you must pay a contribution towards costs
ga: Má tá tú i dteideal cúnamh agus comhairle dlí a fháil ón mBord um Chúnamh Dlíthiúil, ní mór duit ranníocaíocht a íoc i dtreo na gcostas

source: Contact your nearest law centre for information on Legal Aid
ga: Déan teagmháil le d’ionad dlí is gaire duit chun teacht ar fhaisnéis faoi Chúnamh Dlí

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Eagraíocht neamhspleách, dheonach iad ICDSanna (Ionaid Chomhairle Dlí Saor in Aisce) ag a bhfuil líonra clinicí comhairle á oibriú ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún, saor in aisce agus oscailte do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil leis an Ionad um Fhaisnéis do Shaoránaigh is gaire duit chun teacht ar fhaisnéis ar sheirbhísí ICDS i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Tá líne ghutháin faisnéise agus atreoraithe á reáchtáil ag ICDS le linn uaireanta oifige le haghaidh faisnéis bhunúsach dlí
